In [39]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
#memasukan data latih
datalatih = pd.read_excel("data testing.xls")
datalatih.head(15)

# KETERANGAN

# suka musik 
#  1 = tidak suka
#  2 = suka
#  3 = kadang - kadang

# suka membaca
#  1 = tidak suka
#  2 = suka
#  3 = kadang - kadang

# suka olahraga
#  1 = tidak suka
#  2 = suka
#  3 = kadang - kadang

# senang diskusi
#  1 = tidak suka
#  2 = suka
#  3 = kadang - kadang

# suka menggambar
#  1 = tidak suka
#  2 = suka
#  3 = kadang - kadang

# suka menari
#  1 = tidak suka
#  2 = suka
#  3 = kadang - kadang

# gaya belajar
#  1 = Auditori
#  2 = Visual
#  3 = Kinestetik

,Jenis Kelamin,suka musik,Suka Membaca,Suka Olahraga,Senang Diskusi,Suka Menggambar,Suka Menari,Gaya Belajar
0,Laki-laki,2,1,1,2,1,1,1
1,Perempuan,1,2,2,1,2,1,2
2,Perempuan,1,1,2,1,1,2,3
3,Laki-laki,3,2,3,1,1,2,3
4,Laki-laki,1,2,2,1,2,1,2
5,Laki-laki,1,1,2,1,1,2,3
6,Laki-laki,2,3,3,2,1,1,1
7,Perempuan,3,3,1,1,2,2,2
8,Perempuan,3,2,1,2,1,1,1
9,Perempuan,1,2,1,3,2,1,2
10,Laki-laki,2,3,2,2,1,1,2
11,Laki-laki,2,1,2,2,1,1,1
12,Perempuan,2,1,1,2,3,1,1
13,Perempuan,2,2,1,2,1,3,1
14,Laki-laki,1,1,2,1,1,1,3

In [40]:
datalatih.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Jenis Kelamin    15 non-null     object
 1   suka musik       15 non-null     int64
 2   Suka Membaca     15 non-null     int64
 3   Suka Olahraga    15 non-null     int64
 4   Senang Diskusi   15 non-null     int64
 5   Suka Menggambar  15 non-null     int64
 6   Suka Menari      15 non-null     int64
 7   Gaya Belajar     15 non-null     int64
dtypes: int64(7), object(1)
memory usage: 964.0+ bytes

In [41]:
x = datalatih.drop(["Jenis Kelamin"], axis=1)
x.head(15)

,suka musik,Suka Membaca,Suka Olahraga,Senang Diskusi,Suka Menggambar,Suka Menari,Gaya Belajar
0,2,1,1,2,1,1,1
1,1,2,2,1,2,1,2
2,1,1,2,1,1,2,3
3,3,2,3,1,1,2,3
4,1,2,2,1,2,1,2
5,1,1,2,1,1,2,3
6,2,3,3,2,1,1,1
7,3,3,1,1,2,2,2
8,3,2,1,2,1,1,1
9,1,2,1,3,2,1,2
10,2,3,2,2,1,1,2
11,2,1,2,2,1,1,1
12,2,1,1,2,3,1,1
13,2,2,1,2,1,3,1
14,1,1,2,1,1,1,3

In [42]:
y = datalatih["Gaya Belajar"]
y.head(15)

0     1
1     2
2     3
3     3
4     2
5     3
6     1
7     2
8     1
9     2
10    2
11    1
12    1
13    1
14    3
Name: Gaya Belajar, dtype: int64

In [43]:
from sklearn.model_selection import train_test_split
# Import Gaussian Naive Bayes model
from sklearn.naive_bayes import GaussianNB
# Mengaktifkan/memanggil/membuat fungsi klasifikasi Naive bayes
modelnb = GaussianNB()
# Memasukkan data training pada fungsi klasifikasi naive bayes
nbtrain = modelnb.fit(x, y)
datauji = pd.read_excel("data uji.xls")
datauji.head(5)

,Jenis Kelamin,suka musik,Suka Membaca,Suka Olahraga,Senang Diskusi,Suka Menggambar,Suka Menari,Gaya Belajar
0,perempuan,2,3,1,2,2,1,3
1,laki-laki,1,1,2,3,1,1,3
2,perempuan,2,2,1,1,2,3,2
3,laki-laki,1,3,2,3,1,1,1
4,perempuan,2,1,1,2,3,1,2

In [44]:
x_test = datauji.drop(["Jenis Kelamin"], axis=1)
x_test.head(5)

,suka musik,Suka Membaca,Suka Olahraga,Senang Diskusi,Suka Menggambar,Suka Menari,Gaya Belajar
0,2,3,1,2,2,1,3
1,1,1,2,3,1,1,3
2,2,2,1,1,2,3,2
3,1,3,2,3,1,1,1
4,2,1,1,2,3,1,2

In [45]:
y_uji = datauji["Gaya Belajar"]
y_uji.head(5)

0    3
1    3
2    2
3    1
4    2
Name: Gaya Belajar, dtype: int64

In [46]:
Y_predict = nbtrain.predict(x_test)
print("Prediksi Naive Bayes : ",Y_predict)

Prediksi Naive Bayes :  [2 2 2 1 2]

In [47]:
from sklearn.metrics import accuracy_score
accuracy= accuracy_score(y_uji, Y_predict)
print("Akurasi Naive Bayes : ",accuracy)

Akurasi Naive Bayes :  0.6

In [48]:
# Menghitung nilai akurasi dari klasifikasi naive bayes 
from sklearn.metrics import classification_report
print(classification_report(y_uji, Y_predict))

              precision    recall  f1-score   support

           1       1.00      1.00      1.00         1
           2       0.50      1.00      0.67         2
           3       0.00      0.00      0.00         2

    accuracy                           0.60         5
   macro avg       0.50      0.67      0.56         5
weighted avg       0.40      0.60      0.47         5

C:\Users\Muhammad Askar\AppData\Local\Programs\Python\Python38-32\lib\site-packages\sklearn\metrics\_classification.py:1221: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))